{
  "HomePage": {
    "title1": "Construire des ponts",
    "title2": "entre idées et écrans.",
    "titleBridge": "ponts",
    "titleIdeas": "idées",
    "titleScreens": "écrans",
    "subtitle": "Je suis un stagiaire développeur web, actuellement en alternance.",
    "about": "Aller à la page à propos",
    "location": "NIVELLES, BELGIQUE",
    "buttonContact": "Contactez moi",
    "downloadCV": "Télécharger mon CV",
    "stackTitle": "Ma Stack",
    "stackDescription": "Toujours en apprentissage, j'ai opté pour une stack avec laquelle je suis à l'aise, mais je reste ouvert à toutes opportunitées d'apprendre de nouvelles technologies.",
    "next": "Framework React pour applications web.",
    "tailwind": "Framework CSS utilitaire, rapide, personnalisable.",
    "git": "Système de contrôle de version.",
    "php": "Langage de script serveur dynamique.",
    "javascript": "Langage de programmation web interactif.",
    "mysql": "Base de données.",

    "projectsTitle": "Mes projets",
    "projectsDescription": "Voici les projets que j'ai réalisé au cours de mon parcours",
    "projectsVisit": "Visiter",
    "projectsAbout": "À propos",
    "projectsGithub": "GitHub",
    "projectsObjective": "Objectif du projet",
    "projectsRole": "Mon rôle",
    "projectsObstacles": "Obstacles rencontrés",
    "projectsDescriptionStoryTeller": "Plateforme collaborative de création littéraire basée sur le concept du \"cadavre exquis\". Cette application permet aux utilisateurs de participer à l'écriture d'histoires collectives, développée dans le cadre d'un projet académique de fin d'études.",
    "projectsDescriptionDreams": "Application Web pour suivre ses lectures et les noter, avec l'utilisation de l'API Google Books, développée dans le cadre d'un projet académique de fin d'études.",
    "projectsDescriptionAdopteUnCube": "Site vitrine conçu et développé pour une communauté de joueurs, principalement axée sur Minecraft. J'ai pris en charge l'intégralité du design et de la mise en œuvre technique.",

    "storytellerObjective": "Ce projet a été réalisé comme travail de fin d’année lors de ma première année de formation en alternance à l’IFAPME de Charleroi. L’objectif était de mettre en pratique les compétences acquises durant l’année, c’est pourquoi le projet est écrit en PHP. L’application vise à offrir une plateforme d’écriture collaborative inspirée du jeu « cadavre exquis » : chacun peut commencer une histoire, limitée par un nombre de mots, puis une autre personne peut poursuivre l’histoire, et ainsi de suite.",
    "storytellerResponsabilities": "Pour ce projet, j’ai conçu la quasi-totalité du design moi-même, en m’inspirant du style d’un véritable journal écrit, notamment celui du New York Times. J’ai également relevé plusieurs défis techniques : la mise en place d’un système d’inscription et de connexion sécurisé, la conception d’un schéma MySQL adapté aux fonctionnalités prévues, ainsi que le développement de toutes les interactions utilisateur (ajout et continuation d’histoires, likes, recherche, etc.).",
    "storytellerObstacles": "Le principal défi de ce projet a été de concevoir une interface utilisateur à la fois esthétique et fonctionnelle, tout en respectant les contraintes techniques du PHP. J’ai également dû apprendre à gérer les interactions avec une base de données MySQL, ce qui était nouveau pour moi à l’époque. Enfin, j’ai rencontré un soucis de chargement lent des pages d'histoires, que j'ai résolu en implémentant une pagination efficace et un chargement asynchrone des contenus.",

    "scrollDown": "Faites défiler vers le bas"
  },
  "Contact": {
    "title": "Contactez - moi",
    "description": "Si vous avez des questions, <lbr/>une offre, des retours <lbr/>ou si vous voulez simplement dire bonjour, <lbr/>n'hésitez pas à me contacter !",
    "formHello": "Bonjour,",
    "formName": "Mon nom est",
    "formNamePlaceholder": "Votre nom",
    "formEmail": "et mon email est",
    "formEmailPlaceholder": "Votre email",
    "formSubject": "J'ai une",
    "formSubjectPlaceholder": "Question, Offre etc",
    "formMessage": "J'aimerais ajouter :",
    "formMessagePlaceholder": "Votre message",
    "formSubmit": "Envoyer"
  }
}
